app/views/affirmations/index.html.erb

SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    					<div class="nav nav-tabs nav-fill" id="nav-tab" role="tablist">
    						<a class="nav-item nav-link active" id="nav-<%= @categories.first.category_safe %>-tab" data-toggle="tab" href="#nav-<%= @categories.first.category_safe %>" role="tab" aria-controls="nav-<%= @categories.first.category_safe %>" aria-selected="true"><%= @categories.first.category %></a>

SELECT  "categories".* FROM "categories" ORDER BY id ASC LIMIT $1  [["LIMIT", 1]]
---
      					<div class="tab-pane fade show active" id="nav-<%= @categories.first.category_safe %>" role="tabpanel" aria-labelledby="nav-<%= @categories.first.category_safe %>-tab">
      					  <%= @categories.first.category %>