app/controllers/affirmations_controller.rb

  def index
    @affirmations = Affirmation.all.order("id ASC")
    @categories = Category.all.order("id ASC")
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]