app/controllers/blog_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY id ASC
---
  def index
    @blogs = Blog.order("id ASC");

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def viewblog
    @blog = Blog.find(params[:id])