app/controllers/blog_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."pinned" = $1 ORDER BY id ASC  [["pinned", false]]
---
  def index
    @pinned = Blog.where(pinned: true).order("id ASC");