app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "affirmation", "cat", "sub", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @favorite = Favorite.new(favorite_params)
    if @favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
---
  def index
    @affirmations = Favorite.where(user_id: current_user.id)

DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 8]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def destroy
    Favorite.find(params[:id]).destroy