app/controllers/home_controller.rb

  def index
    @blogs = Blog.where(pinned: true)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."pinned" = $1 ORDER BY "blogs"."id" ASC  [["pinned", true]]