app/controllers/view_affirmations_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
SELECT "lifestyles".* FROM "lifestyles" WHERE (sub1='Free time' OR sub2='Free time' OR sub3='Free time' OR sub4='Free time' OR sub5='Free time')
SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1='Free time' OR sub2='Free time' OR sub3='Free time' OR sub4='Free time' OR sub5='Free time')
SELECT "mental_healths".* FROM "mental_healths" WHERE (sub1='Free time' OR sub2='Free time' OR sub3='Free time' OR sub4='Free time' OR sub5='Free time')
SELECT "physical_healths".* FROM "physical_healths" WHERE (sub1='Free time' OR sub2='Free time' OR sub3='Free time' OR sub4='Free time' OR sub5='Free time')
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "lifestyles".* FROM "lifestyles" WHERE (sub1 like 'Wealth' OR sub2 like 'Wealth' OR sub3 like 'Wealth' OR sub4 like 'Wealth' OR sub5 like 'Wealth')
SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1 like 'Wealth' OR sub2 like 'Wealth' OR sub3 like 'Wealth' OR sub4 like 'Wealth' OR sub5 like 'Wealth')
SELECT "mental_healths".* FROM "mental_healths" WHERE (sub1 like 'Wealth' OR sub2 like 'Wealth' OR sub3 like 'Wealth' OR sub4 like 'Wealth' OR sub5 like 'Wealth')
SELECT "physical_healths".* FROM "physical_healths" WHERE (sub1 like 'Wealth' OR sub2 like 'Wealth' OR sub3 like 'Wealth' OR sub4 like 'Wealth' OR sub5 like 'Wealth')
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "lifestyles".* FROM "lifestyles" WHERE (sub1 like 'Self-esteem' OR sub2 like 'Self-esteem' OR sub3 like 'Self-esteem' OR sub4 like 'Self-esteem' OR sub5 like 'Self-esteem')
SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1 like 'Self-esteem' OR sub2 like 'Self-esteem' OR sub3 like 'Self-esteem' OR sub4 like 'Self-esteem' OR sub5 like 'Self-esteem')
SELECT "mental_healths".* FROM "mental_healths" WHERE (sub1 like 'Self-esteem' OR sub2 like 'Self-esteem' OR sub3 like 'Self-esteem' OR sub4 like 'Self-esteem' OR sub5 like 'Self-esteem')
SELECT "physical_healths".* FROM "physical_healths" WHERE (sub1 like 'Self-esteem' OR sub2 like 'Self-esteem' OR sub3 like 'Self-esteem' OR sub4 like 'Self-esteem' OR sub5 like 'Self-esteem')
SELECT "lifestyles".* FROM "lifestyles" WHERE (sub1 like 'Achievement' OR sub2 like 'Achievement' OR sub3 like 'Achievement' OR sub4 like 'Achievement' OR sub5 like 'Achievement')
SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1 like 'Achievement' OR sub2 like 'Achievement' OR sub3 like 'Achievement' OR sub4 like 'Achievement' OR sub5 like 'Achievement')
SELECT "mental_healths".* FROM "mental_healths" WHERE (sub1 like 'Achievement' OR sub2 like 'Achievement' OR sub3 like 'Achievement' OR sub4 like 'Achievement' OR sub5 like 'Achievement')
SELECT "physical_healths".* FROM "physical_healths" WHERE (sub1 like 'Achievement' OR sub2 like 'Achievement' OR sub3 like 'Achievement' OR sub4 like 'Achievement' OR sub5 like 'Achievement')
SELECT "safe_and_secures".* FROM "safe_and_secures" WHERE (sub1 like 'Achievement' OR sub2 like 'Achievement' OR sub3 like 'Achievement' OR sub4 like 'Achievement' OR sub5 like 'Achievement')
---
  def index
    @category = params[:category]
    @sub = params[:sub]
    @sub[0] = @sub[0].capitalize

    @favories = Favorite.where(user_id: current_user.id);


    @all_affirmations = (Success.all + LoveAndRelationship.all + SelfFulfillment.all + Lifestyle.all + PhysicalHealth.all + MentalHealth.all + Spirituality.all + SafeAndSecure.all)


    if @category == 'coronavirus'
      @cat = Category.find(10)
      @affirmations = Success.where('tags like ?', @sub) + LoveAndRelationship.where('tags like ?', @sub) + SelfFulfillment.where('tags like ?', @sub) + Lifestyle.where('tags like ?', @sub) + PhysicalHealth.where('tags like ?', @sub) + MentalHealth.where('tags like ?', @sub) + Spirituality.where('tags like ?', @sub) + SafeAndSecure.where('tags like ?', @sub)
    elsif @category == 'politics'
        @cat = Category.find(9)
        @affirmations = Success.where('tags like ?', @sub) + LoveAndRelationship.where('tags like ?', @sub) + SelfFulfillment.where('tags like ?', @sub) + Lifestyle.where('tags like ?', @sub) + PhysicalHealth.where('tags like ?', @sub) + MentalHealth.where('tags like ?', @sub) + Spirituality.where('tags like ?', @sub) + SafeAndSecure.where('tags like ?', @sub)
elsif @category == 'success'
      puts @category
      @cat = Category.find(1)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)
    elsif @category == 'love_relationships'
      @cat = Category.find(2)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)
    elsif @category == 'self_fulfillment'
      @cat = Category.find(3)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "lifestyles".* FROM "lifestyles" WHERE (sub1 like 'Nutrition' OR sub2 like 'Nutrition' OR sub3 like 'Nutrition' OR sub4 like 'Nutrition' OR sub5 like 'Nutrition')
SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1 like 'Nutrition' OR sub2 like 'Nutrition' OR sub3 like 'Nutrition' OR sub4 like 'Nutrition' OR sub5 like 'Nutrition')
SELECT "mental_healths".* FROM "mental_healths" WHERE (sub1 like 'Nutrition' OR sub2 like 'Nutrition' OR sub3 like 'Nutrition' OR sub4 like 'Nutrition' OR sub5 like 'Nutrition')
SELECT "physical_healths".* FROM "physical_healths" WHERE (sub1 like 'Nutrition' OR sub2 like 'Nutrition' OR sub3 like 'Nutrition' OR sub4 like 'Nutrition' OR sub5 like 'Nutrition')
---
      @cat = Category.find(4)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)
    elsif @category == 'physical_health'
      @cat = Category.find(5)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)

SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1 like 'Wealth' OR sub2 like 'Wealth' OR sub3 like 'Wealth' OR sub4 like 'Wealth' OR sub5 like 'Wealth')
SELECT "successes".* FROM "successes" WHERE (sub1 like 'Wealth' OR sub2 like 'Wealth' OR sub3 like 'Wealth' OR sub4 like 'Wealth' OR sub5 like 'Wealth')
SELECT "lifestyles".* FROM "lifestyles" WHERE (sub1 like NULL OR sub2 like NULL OR sub3 like NULL OR sub4 like NULL OR sub5 like NULL)
SELECT "love_and_relationships".* FROM "love_and_relationships" WHERE (sub1 like NULL OR sub2 like NULL OR sub3 like NULL OR sub4 like NULL OR sub5 like NULL)
SELECT "mental_healths".* FROM "mental_healths" WHERE (sub1 like NULL OR sub2 like NULL OR sub3 like NULL OR sub4 like NULL OR sub5 like NULL)
SELECT "physical_healths".* FROM "physical_healths" WHERE (sub1 like NULL OR sub2 like NULL OR sub3 like NULL OR sub4 like NULL OR sub5 like NULL)
---
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)
    elsif @category == 'spirituality'
      @cat = Category.find(7)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)
    elsif @category == 'safe_secure'
      @cat = Category.find(8)
      @affirmations = Success.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + LoveAndRelationship.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SelfFulfillment.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Lifestyle.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + PhysicalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + MentalHealth.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + Spirituality.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub) + SafeAndSecure.where('sub1 like ? OR sub2 like ? OR sub3 like ? OR sub4 like ? OR sub5 like ?', @sub, @sub, @sub, @sub, @sub)