app/controllers/view_affirmations_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @category = params[:category]
    @sub = params[:sub]
    @sub[0] = @sub[0].capitalize

    if @category == 'coronavirus'
      @cat = Category.find(10)
      @affirmations = Success.where('tags like ?', @sub) + LoveAndRelationship.where('tags like ?', @sub) + SelfFulfillment.where('tags like ?', @sub) + Lifestyle.where('tags like ?', @sub) + PhysicalHealth.where('tags like ?', @sub) + MentalHealth.where('tags like ?', @sub) + Spirituality.where('tags like ?', @sub) + SafeAndSecure.where('tags like ?', @sub)
    elsif @category == 'politics'
        @cat = Category.find(9)